glx-technologies/arduino-gct301s/boards.txt
alpha.name=GCT301S Alpha
alpha.build.board=GCT301S_ALPHA
alpha.build.mcu=cortex-m0
alpha.build.f_cpu=8000000
alpha.build.core=gct301s
alpha.build.variant=alpha
alpha.build.variant_system_lib=
alpha.build.ldscript=gct301s.ld
alpha.build.openocdscript=openocd_alpha.cfg

alpha.upload.tool=openocd
alpha.upload.protocol=
alpha.upload.maximum_size=131072

alpha.upload.interface=cmsis-dap

menu.Interface=Interface

alpha.menu.Interface.cmsis=CMSIS-DAP
alpha.menu.Interface.cmsis.build.interface=cmsis-dap
alpha.menu.Interface.cmsis.build.transport=swd
alpha.menu.Interface.jlink=J-Link
alpha.menu.Interface.jlink.build.interface=jlink
alpha.menu.Interface.jlink.build.transport=swd
alpha.menu.Interface.stlink=ST-Link/v2
alpha.menu.Interface.stlink.build.interface=stlink-v2
alpha.menu.Interface.stlink.build.transport=hla_swd

